src/Catalogs/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Долги</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляУчетаВзятыхДолгов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляУчетаВыданныхДолгов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПараметрыГрафикаПогашенияДолгов/ПараметрыГрафикаПогашенияДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыГрафикаПогашенияДолгов</name>
  <resources>
    <name>ДатаВозникновенияДолга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕдиноразовойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕжемесячнойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПогашения</name>
    <type>
      <types>EnumRef.СпособыПогашенияКредита</types>
    </type>
  </resources>
  <resources>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейВГоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньМесяцаДляРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияДолга</name>
    <comment>С этой даты отменяются все плановые операции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПересчитыватьПриРедактировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонОперации</name>
    <type>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>КошелекДляПогашения</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </resources>
  <resources>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДляУчетаПроцентов</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕдиноразовойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕжемесячнойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Расписания/Расписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расписания</name>
  <resources>
    <name>ВалютаДохода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаРасхода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРасписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.СпособыПовторовСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокДнейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонДнейНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонНомеровМесяцев</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонЧиселМесяца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецРасписания</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/Documents/ВводИзменениеОстатка/ВводИзменениеОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводИзменениеОстатка</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстатка</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстаткаПроцентов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДохода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстаткаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/ChartsOfAccounts/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>РазделыУчета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>100</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>СвободныеДеньги</name>
        <description>Свободные деньги</description>
        <code>100.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Накопления</name>
        <description>Накопления</description>
        <code>100.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>200</code>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>500</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ОсновныеСуммыДолгов</name>
        <description>Основные суммы долгов</description>
        <code>500.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПроцентыПоДолгам</name>
        <description>Проценты по долгам</description>
        <code>500.20</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>900</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗаголовокДляСубконтоПоДебету</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокДляСубконтоПоКредиту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

src/Catalogs/Долги/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСФормамиСправочников.ФормаОбъектаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Истина, Истина, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСправочников.ФормаОбъектаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка, Истина, Истина, Истина);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	РаботаСФормамиСправочниковКлиент.ФормаОбъектаПриОткрытии(ЭтотОбъект, Отказ, Истина, Истина, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбслуживаниеСправочниковКлиент.ИнформироватьОДобавленииСтатьиБюджета();
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСправочников.ФормаОбъектаПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи, Истина, Истина, Истина);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) И ТекущийОбъект.Активность <> ТекущийОбъект.Ссылка.Активность И ЗначениеЗаполнено(ПараметрыРасписания.ВладелецРасписания) Тогда
		ТаблицаДат = ПлановыеОперации.ПолучитьТаблицуПроизвольныхДатДляРедактирования(ПараметрыРасписания.ВладелецРасписания,
				ПараметрыГрафика.ДатаВозникновенияДолга, 
				КонецГода(ДобавитьМесяц(ПараметрыГрафика.ДатаВозникновенияДолга, ПараметрыГрафика.СрокМесяцев)));
		СохранитьРасписание = Истина;
		АдресПроизвольныхДатРасписания = ПоместитьВоВременноеХранилище(ТаблицаДат, УникальныйИдентификатор);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСправочников.ФормаОбъектаПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Истина, Истина, Истина);
	
	Если СохранитьРасписание И НЕ ЗначениеЗаполнено(ПараметрыРасписания.ВладелецРасписания) Тогда
		
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		
		// Создаем Шаблон платежа
		Если ТекущийОбъект.ИспользоватьДляУчетаВыданныхДолгов
			И НЕ ТекущийОбъект.ИспользоватьДляУчетаВзятыхДолгов Тогда
			
			// Возврат выданного займа
			ШаблонПлатежа = Документы.НамВернулиДолг.СоздатьДокумент();
			ШаблонПлатежа.ЭтоШаблон            = Истина;
			ШаблонПлатежа.Дата                 = ТекущаяДатаСеанса();
			ШаблонПлатежа.ОписаниеОперации     = НСтр("ru='Возврат займа %1'");
			ШаблонПлатежа.ОписаниеОперации     = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПлатежа.ОписаниеОперации, "<" + Объект.Наименование + ">");
			ШаблонПлатежа.ВалютаДолга          = ТекущийОбъект.Валюта;
			ШаблонПлатежа.Кошелек              = ПараметрыГрафика.КошелекДляПогашения;
			ШаблонПлатежа.ВалютаПолучено       = ?(ЗначениеЗаполнено(ШаблонПлатежа.Кошелек.Валюта), ШаблонПлатежа.Кошелек.Валюта, ВалютаУчета);
			Если ШаблонПлатежа.Кошелек.ИспользоватьДляНакоплений Тогда
				ШаблонПлатежа.ФинансоваяЦель   = Справочники.ФинансовыеЦели.ОбщиеНакопления;
			КонецЕсли;
			ШаблонПлатежа.Долг                 = ТекущийОбъект.Ссылка;
			ШаблонПлатежа.Контакт              = ТекущийОбъект.Контакт;
			
			ШаблонПлатежа.Записать();
			
		Иначе
			
			// Погашение полученного кредита
			ШаблонПлатежа = Документы.МыВернулиДолг.СоздатьДокумент();
			ШаблонПлатежа.ЭтоШаблон                     = Истина;
			ШаблонПлатежа.Дата                          = ТекущаяДатаСеанса();
			ШаблонПлатежа.ОписаниеОперации              = НСтр("ru='Погашение кредита %1'");
			ШаблонПлатежа.ОписаниеОперации              = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПлатежа.ОписаниеОперации, "<" + ТекущийОбъект.Наименование + ">");
			ШаблонПлатежа.ВалютаКредита                 = ТекущийОбъект.Валюта;
			ШаблонПлатежа.Кошелек                       = ПараметрыГрафика.КошелекДляПогашения;
			ШаблонПлатежа.ВалютаКошелька                = ?(ЗначениеЗаполнено(ШаблонПлатежа.Кошелек.Валюта), ШаблонПлатежа.Кошелек.Валюта, ВалютаУчета);
			Если ШаблонПлатежа.Кошелек.ИспользоватьДляНакоплений Тогда
				ШаблонПлатежа.ФинансоваяЦель = Справочники.ФинансовыеЦели.ОбщиеНакопления;
			КонецЕсли;
			ШаблонПлатежа.Кредит                        = ТекущийОбъект.Ссылка;
			ШаблонПлатежа.Кредитор                      = ТекущийОбъект.Контакт;
			
			ШаблонПлатежа.Записать();
			
		КонецЕсли;
		
		ПараметрыРасписания.ВладелецРасписания = ШаблонПлатежа.Ссылка;
		ПараметрыГрафика.ШаблонОперации = ПараметрыРасписания.ВладелецРасписания;
		
	КонецЕсли;
	
	
	// Обслуживание плановых операций
	ПлановыеОперации.ПослеЗаписиСправочникДолги(Объект.Ссылка, ПараметрыРасписания, АдресПроизвольныхДатРасписания, СохранитьРасписание, ПараметрыГрафика);
	
	ЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан элемент справочника", Новый Структура("ИмяСправочника,Ссылка,ВладелецФормы", "Долги", Объект.Ссылка, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	РаботаСФормамиСправочниковКлиент.ФормаОбъектаПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи, Истина, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Записана операция" Тогда
		
		ВидДокумента = "";
		ЭтоШаблон = Ложь;
		Если Параметр.Свойство("ВидДокумента", ВидДокумента) И Параметр.Свойство("ЭтоШаблон", ЭтоШаблон) И ЭтоШаблон = Истина Тогда
			Если ВидДокумента = "МыВернулиДолг" ИЛИ ВидДокумента = "НамВернулиДолг" Тогда
				ОбновитьШаблонПлатежей();
			КонецЕсли; 
		КонецЕсли; 
		
	ИначеЕсли ИмяСобытия = "Изменено расписание" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		ИмяСправочника = Неопределено;
		ФормаВладельца = Неопределено;
		Если Параметр.Свойство("ВладелецФормы", ФормаВладельца) И ФормаВладельца = ЭтаФорма.УникальныйИдентификатор Тогда
			РаботаСФормамиСправочниковКлиентСервер.ОбслужитьАвтоНаименованиеДолга(ЭтаФорма);
			УправлениеФормой();
		КонецЕсли; 
		
	ИначеЕсли ИмяСобытия = "Записана операция" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		ВидДокумента = Неопределено;
		ФормаВладельца = Неопределено;
		Если Параметр.Свойство("ВидДокумента", ВидДокумента) И ВидДокумента = "ВводИзменениеОстатка"
			И Параметр.Свойство("ВладелецФормы", ФормаВладельца) И ФормаВладельца = ЭтаФорма.УникальныйИдентификатор Тогда
			ПриИзмененииОстаткаСервер();
			ОбновитьОтображениеДанных();
		КонецЕсли; 
	КонецЕсли; 
		
	#Область ПрикрепленныеФайлы
	Если (ПрикрепленныеФайлыКлиент.ЭтоПрикреплениеФайла(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиент.ОбработатьОповещениеДобавленияФайла(ЭтотОбъект, Параметр);
	ИначеЕсли (ПрикрепленныеФайлыКлиент.ЭтоИзменениеСпискаМультимедиа(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	КонецЕсли; 
	#КонецОбласти
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтактПриИзменении(Элемент)
	
	РаботаСФормамиСправочниковКлиентСервер.ОбслужитьАвтоНаименованиеДолга(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбслуживаниеСправочниковКлиент.РасширенноеПолучениеДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	РаботаСФормамиСправочниковКлиентСервер.ОбслужитьАвтоНаименованиеДолга(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДолгаПриИзменении(Элемент)
	
	Объект.ИспользоватьДляУчетаВзятыхДолгов   = ВидДолга = 2 ИЛИ ВидДолга = 0;
	Объект.ИспользоватьДляУчетаВыданныхДолгов = ВидДолга = 2 ИЛИ ВидДолга = 1;
	
	ПрочитатьЗаписиРегистровСведений();
	
	РаботаСФормамиСправочниковКлиентСервер.ОбслужитьАвтоНаименованиеДолга(ЭтаФорма);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстШаблонаОперацииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьШаблонПлатежей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстГрафикаПогашенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПлановыеОперацииКлиент.ОткрытьРедакторРасписанияИзСправочникаДолги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий", Заголовок);
	
КонецПроцедуры

#Область ПрикрепленныеФайлы

&НаКлиенте
Процедура ПредставлениеТекущегоФайлаНажатие(Элемент, СтандартнаяОбработка)
	ПрикрепленныеФайлыКлиент.ОбработчикНажатияНаТекущийФайл(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлКнопкаНавигацииНажатие(Элемент)
	ПрикрепленныеФайлыКлиент.ФайлКнопкаНавигацииНажатие(ЭтотОбъект, Элемент);
КонецПроцедуры

#КонецОбласти 


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьОстаток(Команда)
	
	ЗначенияЗаполнения = Новый Структура("ОбъектУчета", Объект.Ссылка);
	ПараметрыДокумента = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ВводИзменениеОстатка.ФормаОбъекта", ПараметрыДокумента, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаток(Команда)
	
	СтруктураОстатков = ПолучитьТекущийОстаток(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураОстатков);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Подготовка реквизитов формы
	Если Объект.ИспользоватьДляУчетаВзятыхДолгов И Объект.ИспользоватьДляУчетаВыданныхДолгов Тогда
		ВидДолга = 2; // Взаимный расчет
	ИначеЕсли Объект.ИспользоватьДляУчетаВыданныхДолгов Тогда
		ВидДолга = 1; // Выданый заем
	Иначе
		ВидДолга = 0; // Полученный кредит
	КонецЕсли; 
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗапрещеноМенятьВалюту = РазделыУчета.ЕстьПроводкиПоОбъектуУчета(Объект.Ссылка);
	КонецЕсли; 
	
	ПрочитатьЗаписиРегистровСведений();
	
	РаботаСФормамиСправочниковКлиентСервер.СформироватьСписокВыбораНаименования(Элементы.НаименованиеДолга, Объект, ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Элементы.НаименованиеДолга.СписокВыбора[0];
	КонецЕсли;
	
	// Заполнение дополнительных колонок
	ЗаполнитьДобавленныеКолонки();
	
	// Общие настройки форм элементов справочников
	РаботаСФормамиСправочников.ФормаЭлементаПриСозданииНаСервере(ЭтаФорма);
	
	СтруктураОстатков = ПолучитьТекущийОстаток(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураОстатков);
	
	// Сброс расположения и размеров формы
	ОбщегоНазначенияДеньги.СброситьРазмерИПоложениеФормы(ЭтотОбъект);
	
	#Область ПрикрепленныеФайлы
	ИндексТекущегоФайла = ПрикрепленныеФайлыКлиентСервер.ИндексПервогоГрафическогоФайла(МедиаФайлы);
	ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	#КонецОбласти	
	
	// Настройка внешнего вида
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗаписиРегистровСведений()

	ТекстШаблонаОперации  = НСтр("ru = 'Не задан'") ;
	
	Если Объект.ИспользоватьДляУчетаВзятыхДолгов = Объект.ИспользоватьДляУчетаВыданныхДолгов Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыГрафика, РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.СоздатьМенеджерЗаписи());
		ЗаполнитьЗначенияСвойств(ПараметрыРасписания, РегистрыСведений.Расписания.СоздатьМенеджерЗаписи());
		ТекстШаблонаОперации   = НСтр("ru = 'Для взаимных расчетов не задается'") ;
		ТекстГрафикаПогашения  = НСтр("ru = 'Для взаимных расчетов не задается'") ;
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если Объект.ИспользоватьДляУчетаВзятыхДолгов И НЕ Объект.ИспользоватьДляУчетаВыданныхДолгов Тогда
		Запрос.УстановитьПараметр("ИмяТипа", Тип("ДокументСсылка.МыВернулиДолг"));
	ИначеЕсли НЕ Объект.ИспользоватьДляУчетаВзятыхДолгов И Объект.ИспользоватьДляУчетаВыданныхДолгов Тогда
		Запрос.УстановитьПараметр("ИмяТипа", Тип("ДокументСсылка.НамВернулиДолг"));
	КонецЕсли; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыГрафикаПогашенияДолгов.*,
	|	ЕСТЬNULL(ПараметрыГрафикаПогашенияДолгов.ШаблонОперации.ОписаниеОперации, """") КАК НазваниеШаблона,
	|	ЕСТЬNULL(ПараметрыГрафикаПогашенияДолгов.ШаблонОперации.ПометкаУдаления, Ложь) КАК ПометкаУдаления
	|ИЗ
	|	РегистрСведений.ПараметрыГрафикаПогашенияДолгов КАК ПараметрыГрафикаПогашенияДолгов
	|ГДЕ
	|	ПараметрыГрафикаПогашенияДолгов.Долг = &Ссылка 
	|		И ТИПЗНАЧЕНИЯ(ПараметрыГрафикаПогашенияДолгов.ШаблонОперации) = &ИмяТипа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расписания.*
	|ИЗ
	|	РегистрСведений.Расписания КАК Расписания
	|ГДЕ
	|	Расписания.ВладелецРасписания В
	|			(ВЫБРАТЬ
	|				Параметры.ШаблонОперации
	|			ИЗ
	|				РегистрСведений.ПараметрыГрафикаПогашенияДолгов КАК Параметры
	|			ГДЕ
	|				Параметры.Долг = &Ссылка
	|				И ТИПЗНАЧЕНИЯ(Параметры.ШаблонОперации) = &ИмяТипа
	|)";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыГрафика, Выборка);
		ТекстШаблонаОперации = ?(ЗначениеЗаполнено(Выборка.НазваниеШаблона), Выборка.НазваниеШаблона, НСтр("ru = '<Без названия>'") );
		Если Выборка.ПометкаУдаления Тогда
			ТекстШаблонаОперации = ТекстШаблонаОперации + НСтр("ru = ' (Помечен на удаление!)'"); 
		КонецЕсли; 
	Иначе
		ЗаполнитьЗначенияСвойств(ПараметрыГрафика, РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.СоздатьМенеджерЗаписи());
	КонецЕсли; 
	Выборка = ПакетРезультатов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРасписания, Выборка);
		//ТекстГрафикаПогашения = ПараметрыРасписания.ОписаниеРасписания;
	Иначе
		ТекстГрафикаПогашения = НСтр("ru = 'Не задан'");
		ЗаполнитьЗначенияСвойств(ПараметрыРасписания, РегистрыСведений.Расписания.СоздатьМенеджерЗаписи());
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ОбновитьШаблонПлатежей()

	ПрочитатьЗаписиРегистровСведений();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	Элементы.Валюта.Доступность           = Не ЗапрещеноМенятьВалюту;
	
	ДоступностьШаблона = (Объект.ИспользоватьДляУчетаВзятыхДолгов И НЕ Объект.ИспользоватьДляУчетаВыданныхДолгов)
		ИЛИ (НЕ Объект.ИспользоватьДляУчетаВзятыхДолгов И Объект.ИспользоватьДляУчетаВыданныхДолгов);
	Элементы.ТекстШаблонаОперации.Доступность  = ДоступностьШаблона;
	Элементы.ТекстГрафикаПогашения.Доступность = ДоступностьШаблона; 

	ТекстГрафикаПогашения = ПлановыеОперацииКлиентСервер.ПредставлениеУсловийДолга(ПараметрыГрафика, ПараметрыРасписания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблонПлатежей()
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru = 'Создать шаблон можно только для долга, сохраненного в базе.
			|Записать этот долг?'");
		ОбработчикОтвета = Новый ОписаниеОповещения("ОткрытьШаблонПлатежейЗавершение", ЭтотОбъект);	
		ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ОткрытьФормуШаблонаПлатежей();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОстаткаСервер()

	СтруктураОстатков = ПолучитьТекущийОстаток(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураОстатков);
	УправлениеФормой();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийОстаток(Знач Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Субконто", Ссылка);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.РазделыУчета.Долги);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДатаСеанса()));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	жОстатки.Счет,
	|	СУММА(жОстатки.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.Остатки(&Период, Счет В ИЕРАРХИИ (&Счет), , Субконто1 = &Субконто) КАК жОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	жОстатки.Счет";
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = Новый Структура("ТекущийОстаток,ТекущийОстатокПроцентов", 0, 0);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Счет = ПланыСчетов.РазделыУчета.ОсновныеСуммыДолгов Тогда
				Результат.ТекущийОстаток = ?(Выборка.ВалютнаяСуммаОстаток = NULL, 0, Выборка.ВалютнаяСуммаОстаток);
			ИначеЕсли ЗначениеЗаполнено(Выборка.Счет) Тогда
				Результат.ТекущийОстатокПроцентов = ?(Выборка.ВалютнаяСуммаОстаток = NULL, 0, Выборка.ВалютнаяСуммаОстаток);
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуШаблонаПлатежей()

	Если ЗначениеЗаполнено(ПараметрыГрафика.ШаблонОперации) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПараметрыГрафика.ШаблонОперации);
		Если Объект.ИспользоватьДляУчетаВзятыхДолгов Тогда
			ОткрытьФорму("Документ.МыВернулиДолг.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, Ложь);
		Иначе
			ОткрытьФорму("Документ.НамВернулиДолг.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, Ложь);
		КонецЕсли; 
	Иначе
		Если Объект.ИспользоватьДляУчетаВзятыхДолгов Тогда
			НазваниеШаблона = НСтр("ru = 'Погашение кредита [%1]'");
			НазваниеШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НазваниеШаблона, Объект.Наименование);
			ПараметрыШаблона = Новый Структура("Кредитор,Кредит,ОписаниеОперации,ЭтоШаблон", Объект.Контакт, Объект.Ссылка,
					НазваниеШаблона, Истина);
			ОткрытьФорму("Документ.МыВернулиДолг.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ПараметрыШаблона), ЭтаФорма, Ложь);
		Иначе
			НазваниеШаблона = НСтр("ru = 'Возврат займа [%1]'");
			НазваниеШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НазваниеШаблона, Объект.Наименование);
			ПараметрыШаблона = Новый Структура("Контакт,Долг,СуммаВозвратаДолга,СуммаСписания,ОписаниеОперации,ЭтоШаблон", Объект.Контакт, 
					Объект.Ссылка, 0, 0, НазваниеШаблона, Истина);
			ОткрытьФорму("Документ.НамВернулиДолг.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ПараметрыШаблона), ЭтаФорма, Ложь);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблонПлатежейЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда
			ОткрытьФормуШаблонаПлатежей();
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
